{
    "Frontend": [
      {
        "name": "HTML",
        "level": "Expert",
        "experience": "1 year",
        "skillsInAction": "Created semantic, accessible HTML structures for responsive websites, implemented forms and interactive elements, and ensured cross-browser compatibility."
      },
      {
        "name": "CSS",
        "level": "Intermediate",
        "experience": "1 year",
         
        "skillsInAction": "Designed and implemented responsive layouts, used advanced CSS techniques including Flexbox and Grid, and optimized styles for performance and cross-device consistency."
      },
      {
        "name": "JavaScript",
        "level": "Intermediate",
        "experience": "1 year",
        "skillsInAction": "Built dynamic web applications, handled asynchronous operations with AJAX and Fetch, and utilized modern ES6+ features for code efficiency."
      },
      {
        "name": "React",
        "level": "Intermediate",
        "experience": "1 year ",
        "skillsInAction": "Developed interactive UIs with React components, managed application state using hooks and context, and integrated with RESTful APIs."
      },
      
      {
        "name": "Bootstrap",
        "level": "Intermediate",
        "experience": "1 year",
        "skillsInAction": "Utilized Bootstrap to quickly design responsive and mobile-first web pages."
      },
      {
        "name": "Tailwind CSS",
        "level": "Intermediate",
        "experience": "1 year",
        "skillsInAction": "Applied utility-first CSS framework to create custom, responsive designs efficiently."
      }
    ],
    "Backend": [
      {
        "name": "Node.js",
        "level": "Beginner",
        "experience": "1 years",
        "skillsInAction": "Built server-side applications, created RESTful APIs, and handled asynchronous operations using Node.js's event-driven architecture."
      },
      {
        "name": "Express.js",
        "level": "Intermediate",
        "experience": "1 years",
        "skillsInAction": "Developed web applications and APIs with Express.js, managed routing and middleware, and integrated with databases for dynamic content delivery."
      },
      {
        "name": "MongoDB",
        "level": "Intermediate",
        "experience": "1 years",
        "skillsInAction": "Designed and managed NoSQL databases, optimized queries, and implemented data models for flexible and scalable applications."
      },
      {
        "name": "MySQL",
        "level": "Beginner",
        "experience": "1 years",
        "skillsInAction": "Developed and managed relational databases, optimized SQL queries, and implemented data integrity constraints for reliable data storage."
      }
    ]
  }
  
